In [2]:
import pandas as pd
import numpy as np

In [23]:
s = pd.Series(np.random.randn(10), 
              index=[['a','a','a','b','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,2,3]])

In [24]:
s

a  1    0.783252
   2    0.301681
   3   -0.248908
b  1   -2.457617
   2    1.572211
   3    0.283408
c  1    1.841230
   2    0.007093
d  2    0.442204
   3    0.441306
dtype: float64

In [25]:
s.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [26]:
s['b']

1   -2.457617
2    1.572211
3    0.283408
dtype: float64

In [27]:
s['b':'c']

b  1   -2.457617
   2    1.572211
   3    0.283408
c  1    1.841230
   2    0.007093
dtype: float64

In [29]:
s[('b', 3)]

0.2834077157123065

In [20]:
s['b', 3]

0.58549727742941726

In [30]:
s[:, 2]

a    0.301681
b    1.572211
c    0.007093
d    0.442204
dtype: float64

In [31]:
df = pd.DataFrame(np.arange(12).reshape(4,3),
                 index=[['a','a','b','b'],[1,2,1,2]],
                 columns=[['S','S','B'],['Green','Red','Green']])

In [32]:
df

        S         B
    Green Red Green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [33]:
df.index.names = ['key1','key2']
df.columns.names = ['city', 'color']

In [34]:
df

city          S         B
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [35]:
df['S']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [36]:
df[('S','Green')]

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: (S, Green), dtype: int64

In [37]:
df.loc['a']

city      S         B
color Green Red Green
key2
1         0   1     2
2         3   4     5

In [38]:
df.loc[('a',1)]

city  color
S     Green    0
      Red      1
B     Green    2
Name: (a, 1), dtype: int64

In [39]:
df.loc['b', ('S','Red')]

key2
1     7
2    10
Name: (S, Red), dtype: int64

In [40]:
df.loc[('b',2), 'B']

color
Green    11
Name: (b, 2), dtype: int64

In [42]:
df.loc[('b',1),('S','Green')]

6

In [43]:
df.sort_index(axis=0, level=0)

city          S         B
color     Green Red Green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [44]:
df.sort_index(axis=0, level=1)

city          S         B
color     Green Red Green
key1 key2
a    1        0   1     2
b    1        6   7     8
a    2        3   4     5
b    2        9  10    11

In [45]:
df.sort_index(axis=0, level='key2')

city          S         B
color     Green Red Green
key1 key2
a    1        0   1     2
b    1        6   7     8
a    2        3   4     5
b    2        9  10    11

In [46]:
df.sort_index(axis=1, level=0)

city          B     S
color     Green Green Red
key1 key2
a    1        2     0   1
     2        5     3   4
b    1        8     6   7
     2       11     9  10

In [47]:
df.sort_index(axis=1, level=1)

city          B     S
color     Green Green Red
key1 key2
a    1        2     0   1
     2        5     3   4
b    1        8     6   7
     2       11     9  10

In [48]:
df.sort_values(by=('B','Green'))[::-1]

city          S         B
color     Green Red Green
key1 key2
b    2        9  10    11
     1        6   7     8
a    2        3   4     5
     1        0   1     2

In [49]:
df.sum(axis=0, level=0)

city      S         B
color Green Red Green
key1
a         3   5     7
b        15  17    19

In [50]:
df.sum(axis=0, level=1)

city      S         B
color Green Red Green
key2
1         6   8    10
2        12  14    16

In [51]:
df.mean(axis=1, level='color')

color      Green  Red
key1 key2
a    1         1    1
     2         4    4
b    1         7    7
     2        10   10

In [52]:
df2 = pd.DataFrame({'a': range(7), 'b': range(7,0,-1), 
                    'c': ['one','one','one','two','two','two','two'],
                    'd': [0,1,2,0,1,2,3]})

In [53]:
df2

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [54]:
df3 = df2.set_index(['c','d'])

In [55]:
df3

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [56]:
df2.set_index(['c','d'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [57]:
df3

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [58]:
df3.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [61]:
df4 = pd.DataFrame(np.arange(6).reshape((2,3)),
                    index=['S','B'],
                    columns=['one','two','three'])
df4.index.name = 'city'
df4.columns.name = 'number'

In [62]:
df4

number  one  two  three
city
S         0    1      2
B         3    4      5

In [63]:
df5 = df4.stack()

In [64]:
df5

city  number
S     one       0
      two       1
      three     2
B     one       3
      two       4
      three     5
dtype: int64

In [65]:
df5.unstack()

number  one  two  three
city
S         0    1      2
B         3    4      5

In [66]:
df5.unstack(level=0)

city    S  B
number
one     0  3
two     1  4
three   2  5

In [67]:
df5.unstack(level='city')

city    S  B
number
one     0  3
two     1  4
three   2  5

In [75]:
s1 = pd.Series([0,1,2,3], index=['a','b','c','d'])
s2 = pd.Series([4,5,6], index=['c','d','e'])
s3 = pd.concat([s1, s2], keys=['one','two'])

In [76]:
s3

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [77]:
s3.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [78]:
df5

city  number
S     one       0
      two       1
      three     2
B     one       3
      two       4
      three     5
dtype: int64

In [85]:
df6=pd.DataFrame({'left': df5, 'right': df5+5}, columns=['left', 'right'])
df6.columns.name = 'side'

In [86]:
df6

side         left  right
city number
S    one        0      5
     two        1      6
     three      2      7
B    one        3      8
     two        4      9
     three      5     10

In [87]:
df6.unstack()

side   left           right
number  one two three   one two three
city
S         0   1     2     5   6     7
B         3   4     5     8   9    10

In [88]:
df6.unstack(level='city')

side   left    right
city      S  B     S   B
number
one       0  3     5   8
two       1  4     6   9
three     2  5     7  10

In [89]:
df6.unstack(level='city').stack(level='side')

city           B  S
number side
one    left    3  0
       right   8  5
two    left    4  1
       right   9  6
three  left    5  2
       right  10  7